"""
名称：今天吃什么
作者：邱溪言
版本：V1.0
功能：随机抽取吃什么，让选择困难的用户快速决定
"""

import random
import time

print('你好呀我的选择困难小伙伴，答应我，抽到什么吃什么哦！')
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

class_str = input('请问你想吃大餐还是点外卖呢？（请输入：吃大餐/点外卖）：')

foods_highclass = ['重庆火锅', '烧烤', '美式汉堡大餐', '海底捞', '湘菜', '港式茶餐厅', '粤菜', '川菜', '牛排', '土耳其菜', '印度菜',
                   '泰国菜', '日料', '牛肉火锅', '江浙菜', '云南菜', '海鲜', '自助餐', '韩国料理', '意大利菜']
foods_takeaway = ['卤粉', '湖南米粉', '螺蛳粉', '麻辣香锅', '烧烤', '牛肉粿条', '煲仔饭', '炒牛河', '麦当劳', '肯德基', '烧烤',
                  '饺子', '便当', '炒饭', '串串', '沙拉', '意面', '沙县小吃', '肠粉', '豆浆']

rannum = random.randint(0, 20)

if class_str == '吃大餐':
    print(''
          '原来是想吃点好的呀，我帮你选！'
          '')
    time.sleep(0.8)
    print('不用谢，吃', foods_highclass[rannum], '吧！')
elif class_str == '点外卖':
    print(''
          '原来是想吃外卖呀，我帮你选！'
          '')
    time.sleep(0.8)
    print('不用谢，吃', foods_takeaway[rannum], '吧！')
else:
    print('哎呀，好好回答人家的问题嘛！')

input()
